---
title: CustomFieldData
classe: Autodesk.Revit.DB.CustomFieldData
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# CustomFieldData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double DefaultRowHeightOnSheet { get; }` | `customFieldData.DefaultRowHeightOnSheet` | Double |
| `String FieldName { get; }` | `customFieldData.FieldName` | String |
| `String FieldTooltip { get; }` | `customFieldData.FieldTooltip` | String |
| `Boolean IsValidObject { get; }` | `customFieldData.IsValidObject` | Boolean |
| `Void Dispose()` | `customFieldData.Dispose()` | Void |
| `Guid GetCustomFieldId()` | `customFieldData.GetCustomFieldId()` | Guid |
| `ICustomFieldProperties GetCustomFieldProperties()` | `customFieldData.GetCustomFieldProperties()` | ICustomFieldProperties |
| `Void SetCustomFieldProperties(ICustomFieldProperties)` | `customFieldData.SetCustomFieldProperties(customFieldProperties)` | Void |
| `String ValidateCustomFieldProperties(ICustomFieldProperties)` | `customFieldData.ValidateCustomFieldProperties(customFieldProperties)` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```